### Terraform Plan - `prod`

#### Format Check 🖌 `success`
#### Initialization ⚙️ `success`
#### Validation 🤖 `success`
#### Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
module.rds.random_password.db: Refreshing state... [id=none]
module.secrets.random_password.jwt_secret[0]: Refreshing state... [id=none]
data.aws_region.current: Reading...
module.cloudfront.data.aws_caller_identity.current: Reading...
module.s3.data.aws_caller_identity.current: Reading...
module.ecr.aws_ecr_repository.main: Refreshing state... [id=astro-api-prod]
module.ecs.aws_iam_role.ecs_task: Refreshing state... [id=astro-prod-ecs-task-role]
module.ecr.data.aws_region.current: Reading...
module.dns[0].aws_route53_zone.main[0]: Refreshing state... [id=Z00679006C8UNQEVIHCY]
module.elasticache.aws_elasticache_parameter_group.redis: Refreshing state... [id=astro-prod-redis-params]
module.dns[0].aws_acm_certificate.alb[0]: Refreshing state... [id=arn:aws:acm:us-east-2:559050210551:certificate/a50dd0df-85fc-4b8d-99fe-37855b399e2d]
data.aws_region.current: Read complete after 0s [id=us-east-2]
module.ecr.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.cloudfront.aws_cloudfront_response_headers_policy.security_headers: Refreshing state... [id=37f2cf54-152f-400d-bffb-89d4e1f79f05]
module.cloudfront.aws_cloudfront_cache_policy.frontend: Refreshing state... [id=923b6efe-6523-4e2e-bf46-a776768343c0]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-2:559050210551:cluster/astro-prod-cluster]
module.cloudfront.data.aws_caller_identity.current: Read complete after 0s [id=559050210551]
module.ecs.aws_iam_role.ecs_execution: Refreshing state... [id=astro-prod-ecs-execution-role]
module.s3.data.aws_caller_identity.current: Read complete after 0s [id=559050210551]
module.secrets.data.aws_caller_identity.current: Reading...
module.secrets.data.aws_caller_identity.current: Read complete after 0s [id=559050210551]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/astro-prod-api]
module.ecs.data.aws_caller_identity.current: Reading...
module.cloudfront.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E13R70OIAC98EI]
module.qdrant.aws_iam_role.qdrant_task: Refreshing state... [id=astro-prod-qdrant-task-role]
data.aws_caller_identity.current: Reading...
module.ecs.data.aws_caller_identity.current: Read complete after 0s [id=559050210551]
module.qdrant.aws_iam_role.qdrant_execution: Refreshing state... [id=astro-prod-qdrant-execution-role]
data.aws_caller_identity.current: Read complete after 0s [id=559050210551]
module.ecr.data.aws_caller_identity.current: Reading...
module.ecs.aws_cloudwatch_log_group.celery: Refreshing state... [id=/ecs/astro-prod-celery]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-05b817db1afc21c6c]
module.dns[0].aws_acm_certificate.cloudfront: Refreshing state... [id=arn:aws:acm:us-east-1:559050210551:certificate/a2795682-69c1-4de3-8924-6445e4b3aff0]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=559050210551]
module.s3.aws_s3_bucket.pdfs: Refreshing state... [id=astro-prod-pdfs-559050210551]
module.s3.aws_s3_bucket.backups: Refreshing state... [id=astro-prod-backups-559050210551]
module.s3.aws_s3_bucket.logs[0]: Refreshing state... [id=astro-prod-logs-559050210551]
module.ecs.aws_ecs_cluster_capacity_providers.main: Refreshing state... [id=astro-prod-cluster]
module.ecr.aws_iam_policy.ecr_push: Refreshing state... [id=arn:aws:iam::559050210551:policy/astro-prod-ecr-push]
module.ecr.aws_ecr_lifecycle_policy.main: Refreshing state... [id=astro-api-prod]
module.ecr.aws_iam_policy.ecr_pull: Refreshing state... [id=arn:aws:iam::559050210551:policy/astro-prod-ecr-pull]
module.cloudfront.aws_s3_bucket.frontend: Refreshing state... [id=astro-prod-frontend-559050210551]
module.qdrant.aws_iam_role_policy_attachment.qdrant_execution: Refreshing state... [id=astro-prod-qdrant-execution-role-20260105212504641400000002]
module.ecs.aws_iam_role_policy.ecs_task_logs: Refreshing state... [id=astro-prod-ecs-task-role:astro-prod-ecs-task-logs]
module.ecs.aws_iam_role_policy.ecs_task_logs_celery: Refreshing state... [id=astro-prod-ecs-task-role:astro-prod-ecs-task-logs-celery]
module.ecs.aws_iam_role_policy.ecs_task_exec: Refreshing state... [id=astro-prod-ecs-task-role:astro-prod-ecs-task-exec]
module.ecs.aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=astro-prod-ecs-execution-role-20260103173025237100000003]
module.ecs.aws_iam_role_policy.ecs_execution_secrets: Refreshing state... [id=astro-prod-ecs-execution-role:astro-prod-ecs-execution-secrets]
module.dns[0].aws_route53_record.alb_validation["api.realastrology.ai"]: Refreshing state... [id=Z00679006C8UNQEVIHCY__ee2b85d9b45b94f2b079a4477ce51562.api.realastrology.ai._CNAME]
module.dns[0].aws_route53_record.cloudfront_validation["*.realastrology.ai"]: Refreshing state... [id=Z00679006C8UNQEVIHCY__a7c5941b4247f861d1e503da762b5a6e.realastrology.ai._CNAME]
module.dns[0].aws_route53_record.cloudfront_validation["realastrology.ai"]: Refreshing state... [id=Z00679006C8UNQEVIHCY__a7c5941b4247f861d1e503da762b5a6e.realastrology.ai._CNAME]
module.qdrant.aws_iam_role_policy.qdrant_task_exec: Refreshing state... [id=astro-prod-qdrant-task-role:astro-prod-qdrant-exec]
module.secrets.aws_kms_key.secrets: Refreshing state... [id=db6ceb4e-39ae-49ac-aec0-3db92e0736c9]
module.ecs.aws_iam_role_policy_attachment.ecs_execution_ecr_pull[0]: Refreshing state... [id=astro-prod-ecs-execution-role-20260103173025226200000002]
module.dns[0].aws_acm_certificate_validation.alb[0]: Refreshing state... [id=2026-01-03 18:24:32.088 +0000 UTC]
module.dns[0].aws_acm_certificate_validation.cloudfront[0]: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.secrets.aws_secretsmanager_secret.secret_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/secret-key-FCqyxd]
module.efs.aws_efs_file_system.main: Refreshing state... [id=fs-06bbdf1e98e7b9491]
module.secrets.aws_kms_alias.secrets: Refreshing state... [id=alias/astro-prod-secrets]
module.secrets.aws_secretsmanager_secret.stripe_secret_key[0]: Refreshing state... [id=astro/prod/stripe-secret-key]
module.qdrant.aws_cloudwatch_log_group.qdrant: Refreshing state... [id=/ecs/astro-prod-qdrant]
module.ecs.aws_iam_role_policy.ecs_execution_kms[0]: Refreshing state... [id=astro-prod-ecs-execution-role:astro-prod-ecs-execution-kms]
module.secrets.aws_secretsmanager_secret.openai[0]: Refreshing state... [id=astro/prod/openai-api-key]
module.secrets.aws_secretsmanager_secret.stripe_price_ids[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS]
module.secrets.aws_secretsmanager_secret.stripe_webhook_secret[0]: Refreshing state... [id=astro/prod/stripe-webhook-secret]
module.secrets.aws_secretsmanager_secret.redis_url: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/redis-url-iG8jaI]
module.secrets.aws_secretsmanager_secret.database_url: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/database-url-FTlUtT]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-03ddf29b475476547]
module.vpc.aws_security_group.qdrant: Refreshing state... [id=sg-0386594e9f942f2bb]
module.vpc.aws_route_table.database: Refreshing state... [id=rtb-04b14a1d2b22d4e9c]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0627bf29fc6896ae7]
module.vpc.aws_subnet.database: Refreshing state... [id=subnet-0b37a4b954b113955]
module.vpc.aws_subnet.private: Refreshing state... [id=subnet-0013603a7da8b8d35]
module.vpc.aws_subnet.public_secondary: Refreshing state... [id=subnet-02bcf60955e4a47fa]
module.vpc.aws_security_group.redis: Refreshing state... [id=sg-0c0bffebbc2b62ed6]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0a394589f67734ded]
module.vpc.aws_subnet.database_secondary: Refreshing state... [id=subnet-0df609be3fc357559]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b3684e53cbb9bb19]
module.vpc.aws_security_group.ecs: Refreshing state... [id=sg-038d5fbde95fca18e]
module.vpc.aws_security_group.efs: Refreshing state... [id=sg-02ab28b6a87706c51]
module.vpc.aws_subnet.public: Refreshing state... [id=subnet-053ddb4b087a025d6]
module.s3.aws_s3_bucket_public_access_block.backups: Refreshing state... [id=astro-prod-backups-559050210551]
module.s3.aws_s3_bucket_versioning.backups: Refreshing state... [id=astro-prod-backups-559050210551]
module.s3.aws_s3_bucket_lifecycle_configuration.backups: Refreshing state... [id=astro-prod-backups-559050210551]
module.s3.aws_s3_bucket_server_side_encryption_configuration.backups: Refreshing state... [id=astro-prod-backups-559050210551]
module.qdrant.aws_iam_role_policy.qdrant_task_logs: Refreshing state... [id=astro-prod-qdrant-task-role:astro-prod-qdrant-logs]
module.s3.aws_iam_policy.backup_access: Refreshing state... [id=arn:aws:iam::559050210551:policy/astro-prod-s3-backup-access]
module.s3.aws_s3_bucket_public_access_block.pdfs: Refreshing state... [id=astro-prod-pdfs-559050210551]
module.s3.aws_s3_bucket_server_side_encryption_configuration.pdfs: Refreshing state... [id=astro-prod-pdfs-559050210551]
module.s3.aws_iam_policy.pdf_access: Refreshing state... [id=arn:aws:iam::559050210551:policy/astro-prod-s3-pdf-access]
module.s3.aws_s3_bucket_lifecycle_configuration.pdfs: Refreshing state... [id=astro-prod-pdfs-559050210551]
module.s3.aws_s3_bucket_cors_configuration.pdfs: Refreshing state... [id=astro-prod-pdfs-559050210551]
module.s3.aws_s3_bucket_versioning.pdfs: Refreshing state... [id=astro-prod-pdfs-559050210551]
module.s3.aws_s3_bucket_versioning.logs[0]: Refreshing state... [id=astro-prod-logs-559050210551]
module.s3.aws_s3_bucket_public_access_block.logs[0]: Refreshing state... [id=astro-prod-logs-559050210551]
module.s3.aws_iam_policy.logs_access[0]: Refreshing state... [id=arn:aws:iam::559050210551:policy/astro-prod-s3-logs-access]
module.s3.aws_s3_bucket_lifecycle_configuration.logs[0]: Refreshing state... [id=astro-prod-logs-559050210551]
module.s3.aws_s3_bucket_server_side_encryption_configuration.logs[0]: Refreshing state... [id=astro-prod-logs-559050210551]
module.secrets.aws_secretsmanager_secret_version.secret_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/secret-key-FCqyxd|terraform-20260103173026398200000008]
module.secrets.aws_secretsmanager_secret_version.stripe_secret_key[0]: Refreshing state... [id=astro/prod/stripe-secret-key|terraform-20260108152141180700000001]
module.efs.aws_efs_access_point.qdrant: Refreshing state... [id=fsap-0b8ea1d08b6500253]
module.efs.aws_efs_backup_policy.main: Refreshing state... [id=fs-06bbdf1e98e7b9491]
module.secrets.aws_secretsmanager_secret_version.stripe_price_ids[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS|terraform-20260107004638423200000005]
module.secrets.aws_secretsmanager_secret_version.openai[0]: Refreshing state... [id=astro/prod/openai-api-key|terraform-20260107005448551400000002]
module.secrets.aws_secretsmanager_secret_version.stripe_webhook_secret[0]: Refreshing state... [id=astro/prod/stripe-webhook-secret|terraform-20260108152141180900000002]
module.vpc.aws_vpc_security_group_ingress_rule.alb_http: Refreshing state... [id=sgr-0b7250bcfc3edb8be]
module.vpc.aws_vpc_security_group_ingress_rule.alb_https: Refreshing state... [id=sgr-0c3f07144d28b65aa]
module.cloudfront.aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=astro-prod-frontend-559050210551]
module.cloudfront.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=astro-prod-frontend-559050210551]
module.cloudfront.aws_s3_bucket_versioning.frontend: Refreshing state... [id=astro-prod-frontend-559050210551]
module.cloudfront.aws_s3_bucket_lifecycle_configuration.frontend[0]: Refreshing state... [id=astro-prod-frontend-559050210551]
module.cloudfront.aws_cloudfront_distribution.frontend: Refreshing state... [id=E325WB05GDQWIN]
module.vpc.aws_vpc_security_group_egress_rule.qdrant_to_https: Refreshing state... [id=sgr-080d6ac527760560e]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-070ef870be86d8ee2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a3cc8cdecee8cdd3]
module.vpc.aws_route_table_association.database: Refreshing state... [id=rtbassoc-030ccd9914321aac4]
module.vpc.aws_elasticache_subnet_group.main: Refreshing state... [id=astro-prod-redis-subnet-group]
module.vpc.aws_route_table_association.private: Refreshing state... [id=rtbassoc-06316b3cbebb68a38]
module.vpc.aws_db_subnet_group.main: Refreshing state... [id=astro-prod-db-subnet-group]
module.vpc.aws_route_table_association.database_secondary: Refreshing state... [id=rtbassoc-09177a0c88ee086e9]
module.vpc.aws_vpc_security_group_egress_rule.alb_to_ecs: Refreshing state... [id=sgr-0e084448021db51d3]
module.vpc.aws_vpc_security_group_ingress_rule.ecs_from_alb: Refreshing state... [id=sgr-0082ce4d26df90a36]
module.vpc.aws_vpc_security_group_ingress_rule.redis_from_ecs: Refreshing state... [id=sgr-04463a5844daf5d30]
module.vpc.aws_vpc_security_group_egress_rule.ecs_to_redis: Refreshing state... [id=sgr-06667737d9a7eeaf6]
module.vpc.aws_vpc_security_group_ingress_rule.rds_from_ecs: Refreshing state... [id=sgr-03538b4106a8adfe2]
module.vpc.aws_vpc_security_group_ingress_rule.qdrant_http_from_ecs: Refreshing state... [id=sgr-0abca59fe1b085b2c]
module.vpc.aws_vpc_security_group_egress_rule.ecs_to_rds: Refreshing state... [id=sgr-0cb2a071b68d0b179]
module.vpc.aws_vpc_security_group_ingress_rule.qdrant_grpc_from_ecs: Refreshing state... [id=sgr-0bdb8cb1b9d50ca9e]
module.vpc.aws_vpc_security_group_egress_rule.ecs_to_qdrant: Refreshing state... [id=sgr-0914f640d9bf77c86]
module.vpc.aws_vpc_security_group_egress_rule.ecs_to_internet_https: Refreshing state... [id=sgr-0f10b121b5203cc1b]
module.vpc.aws_vpc_security_group_egress_rule.ecs_to_internet_http: Refreshing state... [id=sgr-022b72df717a83887]
module.vpc.aws_vpc_security_group_ingress_rule.efs_from_qdrant: Refreshing state... [id=sgr-04b936993a49480b9]
module.vpc.aws_vpc_security_group_egress_rule.qdrant_to_efs: Refreshing state... [id=sgr-0cb96071af5cba79c]
module.s3.aws_s3_bucket_policy.backups_ssl_only[0]: Refreshing state... [id=astro-prod-backups-559050210551]
module.s3.aws_s3_bucket_policy.pdfs_ssl_only[0]: Refreshing state... [id=astro-prod-pdfs-559050210551]
module.qdrant.aws_service_discovery_private_dns_namespace.main: Refreshing state... [id=ns-475blaatzyuav2w2]
module.s3.aws_s3_bucket_policy.logs_ssl_only[0]: Refreshing state... [id=astro-prod-logs-559050210551]
module.ecs.aws_lb_target_group.api: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:559050210551:targetgroup/astro-prod-api-tg/437cd6f75db4edd4]
module.cloudfront.aws_s3_bucket_policy.frontend: Refreshing state... [id=astro-prod-frontend-559050210551]
module.vpc.aws_route_table_association.public_secondary: Refreshing state... [id=rtbassoc-0a98b3ffb57c0fd4d]
module.vpc.aws_route_table_association.public: Refreshing state... [id=rtbassoc-06b260c7b8f0c75f9]
module.vpc.aws_nat_gateway.main[0]: Refreshing state... [id=nat-007c666303ba4a1de]
module.efs.aws_efs_mount_target.main: Refreshing state... [id=fsmt-00748d5c7a5b6c8b0]
module.ecs.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:559050210551:loadbalancer/app/astro-prod-alb/7a658ada442f4164]
module.ecs.aws_iam_role_policy_attachment.ecs_task_s3_pdf[0]: Refreshing state... [id=astro-prod-ecs-task-role-20260103173025898200000007]
module.qdrant.aws_iam_role_policy.qdrant_task_efs: Refreshing state... [id=astro-prod-qdrant-task-role:astro-prod-qdrant-efs-access]
module.qdrant.aws_ecs_task_definition.qdrant: Refreshing state... [id=astro-prod-qdrant]
module.dns[0].aws_route53_record.frontend: Refreshing state... [id=Z00679006C8UNQEVIHCY_www.realastrology.ai_A]
module.dns[0].aws_route53_record.root[0]: Refreshing state... [id=Z00679006C8UNQEVIHCY_realastrology.ai_A]
module.elasticache.aws_elasticache_cluster.redis: Refreshing state... [id=astro-prod-redis]
module.rds.aws_db_instance.main: Refreshing state... [id=db-27NOXKAQP2ZROG22VD5WUH5QBI]
module.vpc.aws_route.private_nat[0]: Refreshing state... [id=r-rtb-0b3684e53cbb9bb191080289494]
module.ecs.aws_ecs_task_definition.celery_beat: Refreshing state... [id=astro-prod-celery-beat]
module.qdrant.aws_service_discovery_service.qdrant: Refreshing state... [id=srv-tmslf6hpppyxmase]
module.ecs.aws_ecs_task_definition.celery_worker: Refreshing state... [id=astro-prod-celery-worker]
module.ecs.aws_ecs_task_definition.api: Refreshing state... [id=astro-prod-api]
module.secrets.aws_secretsmanager_secret_version.database_url: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/database-url-FTlUtT|terraform-2026010317375509280000000b]
module.secrets.aws_secretsmanager_secret_version.redis_url: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/redis-url-iG8jaI|terraform-2026010317384877670000000c]
module.ecs.aws_ecs_service.celery_beat: Refreshing state... [id=arn:aws:ecs:us-east-2:559050210551:service/astro-prod-cluster/astro-prod-celery-beat]
module.ecs.aws_ecs_service.celery_worker: Refreshing state... [id=arn:aws:ecs:us-east-2:559050210551:service/astro-prod-cluster/astro-prod-celery-worker]
module.qdrant.aws_ecs_service.qdrant: Refreshing state... [id=arn:aws:ecs:us-east-2:559050210551:service/astro-prod-cluster/astro-prod-qdrant]
module.dns[0].aws_route53_record.api: Refreshing state... [id=Z00679006C8UNQEVIHCY_api.realastrology.ai_A]
module.ecs.aws_lb_listener.https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:559050210551:listener/app/astro-prod-alb/7a658ada442f4164/c567fffac23b6070]
module.ecs.aws_lb_listener.http_redirect[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:559050210551:listener/app/astro-prod-alb/7a658ada442f4164/5833ddf456204351]
module.ecs.aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:us-east-2:559050210551:service/astro-prod-cluster/astro-prod-api]
module.ecs.aws_appautoscaling_target.ecs[0]: Refreshing state... [id=service/astro-prod-cluster/astro-prod-api]
module.ecs.aws_appautoscaling_policy.memory[0]: Refreshing state... [id=astro-prod-memory-scaling]
module.ecs.aws_appautoscaling_policy.cpu[0]: Refreshing state... [id=astro-prod-cpu-scaling]
module.monitoring.aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:us-east-2:559050210551:astro-prod-alerts]
module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=astro-prod-rds-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.redis_cpu_high: Refreshing state... [id=astro-prod-redis-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.rds_storage_low: Refreshing state... [id=astro-prod-rds-storage-low]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_cpu_high: Refreshing state... [id=astro-prod-ecs-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.rds_connections_high: Refreshing state... [id=astro-prod-rds-connections-high]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_task_count_zero: Refreshing state... [id=astro-prod-ecs-task-count-zero]
module.monitoring.aws_sns_topic_policy.alerts: Refreshing state... [id=arn:aws:sns:us-east-2:559050210551:astro-prod-alerts]
module.monitoring.aws_cloudwatch_metric_alarm.alb_5xx_errors: Refreshing state... [id=astro-prod-alb-5xx-errors]
module.monitoring.aws_cloudwatch_metric_alarm.alb_response_time_high: Refreshing state... [id=astro-prod-alb-response-time-high]
module.monitoring.aws_cloudwatch_metric_alarm.ecs_memory_high: Refreshing state... [id=astro-prod-ecs-memory-high]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.api will be updated in-place
  ~ resource "aws_ecs_service" "api" {
        id                                 = "arn:aws:ecs:us-east-2:559050210551:service/astro-prod-cluster/astro-prod-api"
        name                               = "astro-prod-api"
        tags                               = {
            "Module" = "ecs"
            "Name"   = "astro-prod-api-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-api:35" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.celery_beat will be updated in-place
  ~ resource "aws_ecs_service" "celery_beat" {
        id                                 = "arn:aws:ecs:us-east-2:559050210551:service/astro-prod-cluster/astro-prod-celery-beat"
        name                               = "astro-prod-celery-beat"
        tags                               = {
            "Module" = "ecs"
            "Name"   = "astro-prod-celery-beat-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-celery-beat:9" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.celery_worker will be updated in-place
  ~ resource "aws_ecs_service" "celery_worker" {
        id                                 = "arn:aws:ecs:us-east-2:559050210551:service/astro-prod-cluster/astro-prod-celery-worker"
        name                               = "astro-prod-celery-worker"
        tags                               = {
            "Module" = "ecs"
            "Name"   = "astro-prod-celery-worker-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-celery-worker:9" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.api must be replaced
-/+ resource "aws_ecs_task_definition" "api" {
      ~ arn                      = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-api:35" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints      = []
                    name             = "api"
                  ~ secrets          = [
                        {
                            name      = "DATABASE_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/database-url-FTlUtT"
                        },
                      - {
                          - name      = "OPENAI_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/openai-api-key-I1aoEC"
                        },
                        {
                            name      = "REDIS_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/redis-url-iG8jaI"
                        },
                        {
                            name      = "SECRET_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/secret-key-FCqyxd"
                        },
                      - {
                          - name      = "STRIPE_PRICE_IDS"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS"
                        },
                      - {
                          - name      = "STRIPE_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-secret-key-P0mQyc"
                        },
                      - {
                          - name      = "STRIPE_WEBHOOK_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-webhook-secret-QbMcg5"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "astro-prod-api" -> (known after apply)
      ~ revision                 = 35 -> (known after apply)
        tags                     = {
            "Module" = "ecs"
            "Name"   = "astro-prod-api-task"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_task_definition.celery_beat must be replaced
-/+ resource "aws_ecs_task_definition" "celery_beat" {
      ~ arn                      = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-celery-beat:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints      = []
                    name             = "celery-beat"
                  - portMappings     = []
                  ~ secrets          = [
                        {
                            name      = "DATABASE_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/database-url-FTlUtT"
                        },
                      - {
                          - name      = "OPENAI_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/openai-api-key-I1aoEC"
                        },
                        {
                            name      = "REDIS_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/redis-url-iG8jaI"
                        },
                        {
                            name      = "SECRET_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/secret-key-FCqyxd"
                        },
                      - {
                          - name      = "STRIPE_PRICE_IDS"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS"
                        },
                      - {
                          - name      = "STRIPE_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-secret-key-P0mQyc"
                        },
                      - {
                          - name      = "STRIPE_WEBHOOK_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-webhook-secret-QbMcg5"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "astro-prod-celery-beat" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
        tags                     = {
            "Module" = "ecs"
            "Name"   = "astro-prod-celery-beat-task"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_task_definition.celery_worker must be replaced
-/+ resource "aws_ecs_task_definition" "celery_worker" {
      ~ arn                      = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-celery-worker:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:559050210551:task-definition/astro-prod-celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints      = []
                    name             = "celery-worker"
                  - portMappings     = []
                  ~ secrets          = [
                        {
                            name      = "DATABASE_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/database-url-FTlUtT"
                        },
                      - {
                          - name      = "OPENAI_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/openai-api-key-I1aoEC"
                        },
                        {
                            name      = "REDIS_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/redis-url-iG8jaI"
                        },
                        {
                            name      = "SECRET_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/secret-key-FCqyxd"
                        },
                      - {
                          - name      = "STRIPE_PRICE_IDS"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS"
                        },
                      - {
                          - name      = "STRIPE_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-secret-key-P0mQyc"
                        },
                      - {
                          - name      = "STRIPE_WEBHOOK_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-webhook-secret-QbMcg5"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "astro-prod-celery-worker" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
        tags                     = {
            "Module" = "ecs"
            "Name"   = "astro-prod-celery-worker-task"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.secrets.aws_secretsmanager_secret.openai[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret" "openai" {
      - arn                            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/openai-api-key-I1aoEC" -> null
      - description                    = "OpenAI API key for AI interpretations" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "astro/prod/openai-api-key" -> null
      - kms_key_id                     = "arn:aws:kms:us-east-2:559050210551:key/db6ceb4e-39ae-49ac-aec0-3db92e0736c9" -> null
      - name                           = "astro/prod/openai-api-key" -> null
      - recovery_window_in_days        = 7 -> null
      - tags                           = {
          - "Module" = "secrets"
          - "Name"   = "astro/prod/openai-api-key"
        } -> null
      - tags_all                       = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Module"      = "secrets"
          - "Name"        = "astro/prod/openai-api-key"
          - "Project"     = "astro"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.secrets.aws_secretsmanager_secret.stripe_price_ids[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret" "stripe_price_ids" {
      - arn                            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS" -> null
      - description                    = "Stripe Price IDs for subscription plans" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS" -> null
      - kms_key_id                     = "arn:aws:kms:us-east-2:559050210551:key/db6ceb4e-39ae-49ac-aec0-3db92e0736c9" -> null
      - name                           = "astro/prod/stripe-price-ids" -> null
      - recovery_window_in_days        = 7 -> null
      - tags                           = {
          - "Module" = "secrets"
          - "Name"   = "astro/prod/stripe-price-ids"
        } -> null
      - tags_all                       = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Module"      = "secrets"
          - "Name"        = "astro/prod/stripe-price-ids"
          - "Project"     = "astro"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.secrets.aws_secretsmanager_secret.stripe_secret_key[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret" "stripe_secret_key" {
      - arn                            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-secret-key-P0mQyc" -> null
      - description                    = "Stripe Secret API Key for payment processing" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "astro/prod/stripe-secret-key" -> null
      - kms_key_id                     = "arn:aws:kms:us-east-2:559050210551:key/db6ceb4e-39ae-49ac-aec0-3db92e0736c9" -> null
      - name                           = "astro/prod/stripe-secret-key" -> null
      - recovery_window_in_days        = 7 -> null
      - tags                           = {
          - "Module" = "secrets"
          - "Name"   = "astro/prod/stripe-secret-key"
        } -> null
      - tags_all                       = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Module"      = "secrets"
          - "Name"        = "astro/prod/stripe-secret-key"
          - "Project"     = "astro"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.secrets.aws_secretsmanager_secret.stripe_webhook_secret[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret" "stripe_webhook_secret" {
      - arn                            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-webhook-secret-QbMcg5" -> null
      - description                    = "Stripe Webhook Signing Secret" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "astro/prod/stripe-webhook-secret" -> null
      - kms_key_id                     = "arn:aws:kms:us-east-2:559050210551:key/db6ceb4e-39ae-49ac-aec0-3db92e0736c9" -> null
      - name                           = "astro/prod/stripe-webhook-secret" -> null
      - recovery_window_in_days        = 7 -> null
      - tags                           = {
          - "Module" = "secrets"
          - "Name"   = "astro/prod/stripe-webhook-secret"
        } -> null
      - tags_all                       = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Module"      = "secrets"
          - "Name"        = "astro/prod/stripe-webhook-secret"
          - "Project"     = "astro"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.openai[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "openai" {
      - arn            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/openai-api-key-I1aoEC" -> null
      - id             = "astro/prod/openai-api-key|terraform-20260107005448551400000002" -> null
      - secret_id      = "astro/prod/openai-api-key" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20260107005448551400000002" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.stripe_price_ids[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "stripe_price_ids" {
      - arn            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS" -> null
      - id             = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS|terraform-20260107004638423200000005" -> null
      - secret_id      = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-price-ids-DrkUoS" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20260107004638423200000005" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.stripe_secret_key[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "stripe_secret_key" {
      - arn            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-secret-key-P0mQyc" -> null
      - id             = "astro/prod/stripe-secret-key|terraform-20260108152141180700000001" -> null
      - secret_id      = "astro/prod/stripe-secret-key" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20260108152141180700000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.stripe_webhook_secret[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_secretsmanager_secret_version" "stripe_webhook_secret" {
      - arn            = "arn:aws:secretsmanager:us-east-2:559050210551:secret:astro/prod/stripe-webhook-secret-QbMcg5" -> null
      - id             = "astro/prod/stripe-webhook-secret|terraform-20260108152141180900000002" -> null
      - secret_id      = "astro/prod/stripe-webhook-secret" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20260108152141180900000002" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 3 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @lmeazzini, Action: `pull_request`*